[
    {
        "id": 1,
        "title": "Update #1",
        "twitterUsername": "davidburkett",
        "contentMarkdown": ["In April 2022, the Litecoin MWEB (MimbleWimble Extension Block) project made significant progress. The final testing of the release candidates (RCs) was successful, with all major workflows functioning smoothly. Most mining pools also reported successful mining of MWEB blocks on the testnet, indicating readiness for activation on the mainnet.\u000a\u000a      The official activation of MWEB was scheduled to take place at block height 2,265,984, approximately on May 19th, 2022. This activation would enable users who had updated to version 0.21.2 to start sending and receiving Litecoin (LTC) using the MWEB technology.\u000a      \u000a      A final release, version 0.21.2, was set to be made available for download on the Litecoin website. Users interested in utilizing MWEB were encouraged to upgrade to this official release before the MWEB activation date. Failure to upgrade before activation would require users to resynchronize the blockchain from scratch.\u000a      \u000a      The development team had made substantial changes to the wallet during the testing phase to address issues, and while the consensus logic was stable, they welcomed feedback from users regarding any bugs or unusual behavior encountered when using MWEB."],
        "date": "2022-04-01"
    }, {
        "id": 2,
        "title": "Update #2",
        "twitterUsername": "davidburkett",
        "contentMarkdown": "The update was delayed due to a personal event (10th wedding anniversary celebration).\u000a\u000aA critical wallet bug was discovered after the MWEB activation. Old pre-HD wallets upgraded using 'upgradewallet' generated stealth addresses incorrectly.\u000a\u000aAll funds were safe, but a fix was required for affected users.\u000a\u000aA new version of Litecoin Core (v0.21.2.1) was released with the bug fix.\u000a\u000aAffected users were advised to upgrade to the new version and run 'rescanblockchain' to recover their coins.\u000a\u000aOverall, MWEB was functioning well, but users were encouraged to report any issues on GitHub or in the MWEB telegram channel.\u000a\u000aThe development team was shifting focus to designing mobile wallets and light clients for MWEB, which presented technical challenges."
    }, {
        "id": 3,
        "title": "Update #3",
        "twitterUsername": "indigo_nakamoto",
        "contentMarkdown": "The update was delayed due to a personal event (10th wedding anniversary celebration).\u000a\u000aA critical wallet bug was discovered after the MWEB activation. Old pre-HD wallets upgraded using 'upgradewallet' generated stealth addresses incorrectly.\u000a\u000aAll funds were safe, but a fix was required for affected users.\u000a\u000aA new version of Litecoin Core (v0.21.2.1) was released with the bug fix.\u000a\u000aAffected users were advised to upgrade to the new version and run 'rescanblockchain' to recover their coins.\u000a\u000aOverall, MWEB was functioning well, but users were encouraged to report any issues on GitHub or in the MWEB telegram channel.\u000a\u000aThe development team was shifting focus to designing mobile wallets and light clients for MWEB, which presented technical challenges."
    }
]
